app/controllers/ingredients_controller.rb

    def set_ingredient
      @ingredient = Ingredient.find(params[:id])
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 1]]